INSERT INTO hub.p_hubs (
    id,
    name,
    address,
    created_at,
    created_by,
    updated_at,
    updated_by
)
VALUES
    (
        '00000000-0000-0000-0000-000000000001',
        '서울특별시 센터',
        '서울특별시 송파구 송파대로 55',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000002',
        '경기 북부 센터',
        '경기도 고양시 덕양구 권율대로 570',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000003',
        '경기 남부 센터',
        '경기도 이천시 덕평로 257-21',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000004',
        '부산광역시 센터',
        '부산 동구 중앙대로 206',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000005',
        '대구광역시 센터',
        '대구 북구 태평로 161',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000006',
        '인천광역시 센터',
        '인천 남동구 정각로 29',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000007',
        '광주광역시 센터',
        '광주 서구 내방로 111',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000008',
        '대전광역시 센터',
        '대전 서구 둔산로 100',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000009',
        '울산광역시 센터',
        '울산 남구 중앙로 201',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000010',
        '세종특별자치시 센터',
        '세종특별자치시 한누리대로 2130',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000011',
        '강원특별자치도 센터',
        '강원특별자치도 춘천시 중앙로 1',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000012',
        '충청북도 센터',
        '충북 청주시 상당구 상당로 82',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000013',
        '충청남도 센터',
        '충남 홍성군 홍북읍 충남대로 21',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000014',
        '전북특별자치도 센터',
        '전북특별자치도 전주시 완산구 효자로 225',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000015',
        '전라남도 센터',
        '전남 무안군 삼향읍 오룡길 1',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000016',
        '경상북도 센터',
        '경북 안동시 풍천면 도청대로 455',
        NOW(), 'system', NOW(), 'system'
    ),
    (
        '00000000-0000-0000-0000-000000000017',
        '경상남도 센터',
        '경남 창원시 의창구 중앙대로 300',
        NOW(), 'system', NOW(), 'system'
    )
    ON CONFLICT (id) DO NOTHING;
